# โปรแกรมต้องการแสดงข้อมูลชื่อและอายุออกมาโดยการรับค่าจากผู้ใช้งาน

# สร้างตัวแปรรับค่าจากผู้ใช้งาน
name = input('คุณชื่ออะไร : ')
age = int(input('คุณอายุเท่าไหร่ : '))
# แสดงค่าที่ได้รับจากผู้ใช้งาน
print('คุณชือ : %s'%name)
print('คุณอายุ : %d'%age)

# --------------------------------------------------------
# โปรแกรมแกรมต้องการรู้ว่าค่าตัวเลขที่รับจากผู้ใช้งานมา มากกว่าหรือน้อยกว่า 50

# สร้างตัวแปรรับค่าจากผู้ใช้งาน
number = int(input('กรุณากรอกจำนวนเลขที่ต้องการ : '))
# สร้างคำสั่งเงื่อนไขทางเลือกขึ้นมา
if number > 50:
    print('จำนวนเลขที่ท่านกรอกมากกว่า 50')
else:
    print('จำนวนเลขที่ท่านกรอกน้อยกว่า 50')

# --------------------------------------------------------
# โปรแกรมต้องการหาผลรวมของเลยสองจำนวน ที่รับค่ามาจากผู้ใช้งาน 

# สร้างตัวแปรรับค่าจากผู้ใช้งาน
number1 = int(input('จำนวนตัวเลขที่ 1 : '))
number2 = int(input('จำนวนตัวเลขที่ 2 : '))

# แสดงค่าผลรวมออกทางหน้าจอ
print(number1 + number2)

